Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Comment>Перемещение товаров между складами</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыПроизводстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПотребностьВМатериалахДляМонтажа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПутиНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобрано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииСтатусовПеремещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ТаблицаНазначения</Name>
					<Comment>Дополнительная аналитика для автоматических документов на основании монтажей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтправитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПолучатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаблицаНазначения</Name>
							<Comment>Дополнительная аналитика для автоматических документов на основании монтажей</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИсторияПеремещенийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПеремещенийТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВПутиНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВПутиНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыПроизводстваВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыПроизводстваВПути</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоОтправлено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПолучено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеТоваров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	РеквизитыПользователя = ОбщийМодульСервер.НастройкиПользователя("СкладРозница");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровИУслуг") Тогда
		// Заполнение шапки
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		СкладОтправитель = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Организация = ДанныеЗаполнения.Организация;
		СкладОтправитель = РеквизитыПользователя.СкладРозница;
		//СкладПолучатель = 
		ВариантПеремещенияТоваровИзЗаказДоговора = Константы.ВариантПеремещенияТоваровИзЗаказДоговора.Получить();
		// 0 - только материалы 
		// 1 - материалы, товары 
		// 2 - материалы, товары, потолки
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Материалы Цикл
			Если НЕ ТекСтрокаТовары.Номенклатура.Пустая() Тогда 
				НоваяСтрока = Товары.Добавить();			
				НоваяСтрока.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
				//НоваяСтрока.СерияНоменклатуры 			= ТекСтрокаТовары.СерияНоменклатуры;
				НоваяСтрока.ХарактеристикаНоменклатуры 	= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				НоваяСтрока.ЕдиницаИзмерения 				= ТекСтрокаТовары.ЕдиницаИзмерения;
				НоваяСтрока.Количество 						= ТекСтрокаТовары.Количество;
				НоваяСтрока.Коэффициент 					= ТекСтрокаТовары.Коэффициент;
			КонецЕсли;	
		КонецЦикла;
				 
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.ТоварыУслуги Цикл
			Если НЕ ТекСтрокаТовары.Номенклатура.Пустая() И НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаТовары.Номенклатура) Тогда
				ЭтоПотолок = Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекСтрокаТовары.Номенклатура);
				Если ВариантПеремещенияТоваровИзЗаказДоговора = 1 И НЕ ЭтоПотолок Тогда					
					НоваяСтрока = Товары.Добавить();			
					НоваяСтрока.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
					//НоваяСтрока.СерияНоменклатуры 			= ТекСтрокаТовары.СерияНоменклатуры;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
					НоваяСтрока.ЕдиницаИзмерения 				= ТекСтрокаТовары.ЕдиницаИзмерения;
					НоваяСтрока.Количество 						= ТекСтрокаТовары.Количество;
					НоваяСтрока.Коэффициент 					= ТекСтрокаТовары.Коэффициент;					
				ИначеЕсли ВариантПеремещенияТоваровИзЗаказДоговора = 2 Тогда
					НоваяСтрока = Товары.Добавить();			
					НоваяСтрока.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
					//НоваяСтрока.СерияНоменклатуры 			= ТекСтрокаТовары.СерияНоменклатуры;
					НоваяСтрока.ХарактеристикаНоменклатуры 	= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
					НоваяСтрока.ЕдиницаИзмерения 				= ТекСтрокаТовары.ЕдиницаИзмерения;
					НоваяСтрока.Количество 						= ТекСтрокаТовары.Количество;
					НоваяСтрока.Коэффициент 					= ТекСтрокаТовары.Коэффициент;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеНаСкладМонтажнойБригады;  //#14793
		Основание = ДанныеЗаполнения.Ссылка;
		Назначение = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		СкладОтправитель = РеквизитыПользователя.СкладРозница;
		//СкладПолучатель = 
		ВариантПеремещенияТоваровИзЗаказДоговора = Константы.ВариантПеремещенияТоваровИзЗаказДоговора.Получить();
		// 0 - только материалы 
		// 1 - материалы, товары 
		// 2 - материалы, товары, потолки
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Материалы Цикл
			Если НЕ ТекСтрокаТовары.Номенклатура.Пустая() Тогда 
				НоваяСтрока = Товары.Добавить();			
				НоваяСтрока.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.СерияНоменклатуры 				= ТекСтрокаТовары.СерияНоменклатуры;
				НоваяСтрока.ХарактеристикаНоменклатуры 		= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
				НоваяСтрока.ЕдиницаИзмерения 				= ТекСтрокаТовары.ЕдиницаИзмерения;
				НоваяСтрока.Количество 						= ТекСтрокаТовары.Количество;
				НоваяСтрока.Коэффициент 					= ТекСтрокаТовары.Коэффициент;
			КонецЕсли;	
		КонецЦикла;
				 
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.ТоварыУслуги Цикл
			Если НЕ ТекСтрокаТовары.Номенклатура.Пустая() И НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаТовары.Номенклатура) Тогда
				ЭтоПотолок = Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекСтрокаТовары.Номенклатура);
				Если ВариантПеремещенияТоваровИзЗаказДоговора = 1 И НЕ ЭтоПотолок Тогда					
					НоваяСтрока = Товары.Добавить();			
					НоваяСтрока.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
					НоваяСтрока.СерияНоменклатуры 				= ТекСтрокаТовары.СерияНоменклатуры;
					НоваяСтрока.ХарактеристикаНоменклатуры 		= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
					НоваяСтрока.ЕдиницаИзмерения 				= ТекСтрокаТовары.ЕдиницаИзмерения;
					НоваяСтрока.Количество 						= ТекСтрокаТовары.Количество;
					НоваяСтрока.Коэффициент 					= ТекСтрокаТовары.Коэффициент;					
				ИначеЕсли ВариантПеремещенияТоваровИзЗаказДоговора = 2 Тогда
					НоваяСтрока = Товары.Добавить();			
					НоваяСтрока.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
					НоваяСтрока.СерияНоменклатуры 				= ТекСтрокаТовары.СерияНоменклатуры;
					НоваяСтрока.ХарактеристикаНоменклатуры 		= ТекСтрокаТовары.ХарактеристикаНоменклатуры;
					НоваяСтрока.ЕдиницаИзмерения 				= ТекСтрокаТовары.ЕдиницаИзмерения;
					НоваяСтрока.Количество 						= ТекСтрокаТовары.Количество;
					НоваяСтрока.Коэффициент 					= ТекСтрокаТовары.Коэффициент;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		СкладОтправитель = ДанныеЗаполнения.СкладПолучатель;
		СкладПолучатель = ДанныеЗаполнения.СкладОтправитель;
		Назначение = ДанныеЗаполнения.Назначение;
		Основание = ДанныеЗаполнения.Ссылка;
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Выдача Тогда
			ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеНаСкладМонтажнойБригады;  //#14793
			ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Возврат;
		КонецЕсли;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//Комментарий = ДанныеЗаполнения.Комментарий; //#5849
		Организация = ДанныеЗаполнения.Организация;
		СкладПолучатель = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если НЕ Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекСтрокаТовары.Номенклатура) Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
		// Перемещение готовой продукции по заказу на производство:
		// со склада продукции на склад отгрузки. Переносится только продукция заказа.
		ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеГотовойПродукции;
		Организация = ДанныеЗаполнения.Организация;
		СкладОтправитель = ДанныеЗаполнения.Склад;
		СкладПолучатель = ДанныеЗаполнения.СкладОтгрузки;
		// Тип "ЗаказНаПроизводство" в реквизит "Основание" не входит — указываем заказ покупателя заказа.
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Основание = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;

		Если ДанныеЗаполнения.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка Тогда
			Если НЕ ДанныеЗаполнения.ПродукцияНоменклатура.Пустая() Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ДанныеЗаполнения.ПродукцияНоменклатура;
				НоваяСтрока.ЕдиницаИзмерения = ДанныеЗаполнения.ПродукцияНоменклатураЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = ДанныеЗаполнения.ПродукцияНоменклатураКоэффициент;
				НоваяСтрока.Количество = ДанныеЗаполнения.ПродукцияНоменклатураКоличество;
				НоваяСтрока.Заказ = ДанныеЗаполнения.Ссылка;
			КонецЕсли;
		Иначе
			Для Каждого СтрокаПродукция Из ДанныеЗаполнения.Продукция Цикл
				Если СтрокаПродукция.Номенклатура.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = СтрокаПродукция.Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры = СтрокаПродукция.ХарактеристикаНоменклатуры;
				НоваяСтрока.ЕдиницаИзмерения = СтрокаПродукция.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = СтрокаПродукция.Коэффициент;
				НоваяСтрока.Количество = СтрокаПродукция.Количество;
				НоваяСтрока.Заказ = ДанныеЗаполнения.Ссылка;
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ПоЗаказамНаПроизводство") Тогда
			// из АРМ производства
			ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеГотовойПродукции;  //#14793
			Организация = ДанныеЗаполнения.Организация;
			СкладПолучатель = ДанныеЗаполнения.СкладПолучатель;
			СкладОтправитель = ДанныеЗаполнения.СкладОтправитель;
			Для каждого СтрокаОснования из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования);
				Если ТипЗнч(НоваяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
					НоваяСтрока.Коэффициент = 1;
				Иначе
					НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
				КонецЕсли;
			КонецЦикла; 
			
		ИначеЕсли НЕ ДанныеЗаполнения.Свойство("Основание") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);	
		Иначе			
			//Основание монтаж
			ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеНаСкладМонтажнойБригады;  //#14793
			Основание = ДанныеЗаполнения.Основание;
			Назначение = ДанныеЗаполнения.Основание;
			Организация = ДанныеЗаполнения.Основание.Организация;		
			//ТаблицаНазначения = ДанныеЗаполнения.ТаблицаНазначения;  // #13841 реквизит удален
			
			Если ДанныеЗаполнения.Выдача Тогда
				ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Выдача;
				СкладОтправитель = Константы.СкладПриходРасходПриПеремещенииИзМонтажаБригадам.Получить();
				СкладПолучатель = ДанныеЗаполнения.Склад;
			Иначе
				ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Возврат;
				СкладПолучатель = Константы.СкладПриходРасходПриПеремещенииИзМонтажаБригадам.Получить();
				СкладОтправитель = ДанныеЗаполнения.Склад;
			КонецЕсли;	
			
			Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.ПозицииКПеремещению Цикл
				НоваяСтрока = Товары.Добавить();			
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
				НоваяСтрока.ТаблицаНазначения = ТекущаяСтрока.Таблица;
			КонецЦикла;		
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЭтоНовый() Тогда		
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты();
		
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(СкладОтправитель) И СкладОтправитель = СкладПолучатель Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Один склад не может быть как отправителем, так и получателем. Измените один из складов.",
				ЭтотОбъект,	"СкладОтправитель", , Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	//#16858 изменился статус
	Если НЕ Отказ И СозданПриИспользованииСтатусовПеремещений Тогда		
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			СостояниеПроведения = ?(РежимЗаписи = РежимЗаписиДокумента.Проведение, "проведен", "не проведен");
			Если НЕ ТекущийСтатус = Ссылка.ТекущийСтатус Тогда			
				// изменился статус
				Если НЕ ЗначениеЗаполнено(ТекущийСтатус) Тогда
					ТекстЗаписиИстории = СтрШаблон("Изменен статус с ""%1"" на пустой статус (%2)", ТекущийСтатус, СостояниеПроведения);	
				ИначеЕсли НЕ ЗначениеЗаполнено(Ссылка.ТекущийСтатус) Тогда
					ТекстЗаписиИстории = СтрШаблон("Изменен статус с пустого на ""%1"" (%2)", Ссылка.ТекущийСтатус, СостояниеПроведения);
				Иначе
					ТекстЗаписиИстории = СтрШаблон("Изменен статус с ""%1"" на ""%2"" (%3)", Ссылка.ТекущийСтатус, ТекущийСтатус, СостояниеПроведения);
				КонецЕсли;
				РегистрыСведений.ИсторияПеремещенийТоваров.ДобавитьЗапись(Ссылка, ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), ТекстЗаписиИстории, Новый УникальныйИдентификатор);
				
			ИначеЕсли (РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Ссылка.Проведен) 
				ИЛИ (НЕ РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.Проведен) Тогда
				ТекстЗаписиИстории = СтрШаблон("Изменено состояние на ""%1""", СостояниеПроведения);
				РегистрыСведений.ИсторияПеремещенийТоваров.ДобавитьЗапись(Ссылка, ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), ТекстЗаписиИстории, Новый УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
	
	    // даты изменения статусов
		Если НЕ ТекущийСтатус = Ссылка.ТекущийСтатус Тогда
			Если ТекущийСтатус = Перечисления.СтатусыПеремещений.Заявка Тогда 
				ДатаОтправлено = Дата(1,1,1);
				ДатаПолучено = Дата(1,1,1);
				ДатаСобрано = Дата(1,1,1);
			ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПеремещений.Собран Тогда
				ДатаОтправлено = Дата(1,1,1);
				ДатаПолучено = Дата(1,1,1);
				ДатаСобрано = ТекущаяДатаСеанса();
			ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПеремещений.Отправлен Тогда
				ДатаОтправлено = ТекущаяДатаСеанса();
				ДатаПолучено = Дата(1,1,1);
			ИначеЕсли ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен Тогда
				ДатаПолучено = ТекущаяДатаСеанса();
				Если ДатаОтправлено = Дата(1,1,1) Тогда
					ДатаОтправлено = ДатаПолучено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		//nva+++
		Если НЕ ЭтоНовый() Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийСтатус", Ссылка.ТекущийСтатус);
		КонецЕсли;
		//nva---
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СозданПриИспользованииСтатусовПеремещений
		И (ТекущийСтатус = Перечисления.СтатусыПеремещений.Заявка ИЛИ ТекущийСтатус = Перечисления.СтатусыПеремещений.Собран) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяПриходНаСклад = (НЕ СозданПриИспользованииСтатусовПеремещений
		                      ИЛИ СозданПриИспользованииСтатусовПеремещений И ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен);
							  
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	//ТоварыНаСкладах (расход)
	ТоварыНаСкладахДатаРасхода = Дата;
	Если СозданПриИспользованииСтатусовПеремещений Тогда
		ТоварыНаСкладахДатаРасхода = ДатаОтправлено;
	ИначеЕсли ТоварыНаСкладахДатаРасхода = Дата(1,1,1) Тогда
		ТоварыНаСкладахДатаРасхода = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, СкладОтправитель, Товары, ТоварыНаСкладахДатаРасхода);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//++ №8793 товары нужно свернуть, чтобы корректно списать себестоимость
	мТовары = Товары.Выгрузить();
	мТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество");
	мТовары.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	мТовары.Колонки.Добавить("СуммаВал",Новый ОписаниеТипов("Число"));
	//-- №8793
	Для Каждого СтрокаТовара Из мТовары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТоварыНаСкладахДатаРасхода;
		Движение.Организация = ОрганизацияТоваров;
		Движение.Склад = СкладОтправитель;
		Движение.Номенклатура = СтрокаТовара.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = СтрокаТовара.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
		Движение.Количество = СтрокаТовара.Количество * СтрокаТовара.Коэффициент;
		//#8288
		//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ТоварыНаСкладахДатаСписания, ОрганизацияТоваров, СкладОтправитель, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
		СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ТоварыНаСкладахДатаРасхода, ОрганизацияТоваров, СкладОтправитель, Движение.Номенклатура, Движение.ХарактеристикаНоменклатуры, Движение.СерияНоменклатуры);
		Движение.Сумма = Движение.Количество * СтруктураЦенОстатков.Цена;
		Движение.СуммаВал = Движение.Количество * СтруктураЦенОстатков.ЦенаВал;
		
		СтрокаТовара.Сумма = Движение.Сумма;
		СтрокаТовара.СуммаВал = Движение.СуммаВал;
	КонецЦикла;
	
	//ТоварыВПутиНаСкладах (приход)
	Если СозданПриИспользованииСтатусовПеремещений Тогда
		Движения.ТоварыВПутиНаСкладах.Записывать = Истина;
		Для Каждого Товар Из мТовары Цикл
			Движение = Движения.ТоварыВПутиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ДатаОтправлено;
			Движение.СкладОтправитель = СкладОтправитель;
			Движение.СкладПолучатель = СкладПолучатель;
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.Количество = Товар.Количество * Товар.Коэффициент;
		КонецЦикла;	
	КонецЕсли;
	
	//ТаблицаТоваров = Новый ТаблицаЗначений;
	//ТаблицаТоваров = Товары.Выгрузить();
	//ТаблицаТоваров.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
	//ЗаполнитьСтоимостьПриходаПоСписанию(ТаблицаТоваров);
	
	//ТоварыНаСкладах (приход)
	Если ТребуетсяПриходНаСклад Тогда
		ТоварыНаСкладахДатаПрихода = Дата;
		Если СозданПриИспользованииСтатусовПеремещений Тогда
			ТоварыНаСкладахДатаПрихода = ДатаПолучено;
		КонецЕсли;
		//Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		Для Каждого СтрокаТовара Из мТовары Цикл
			Движение = Движения.ТоварыНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ТоварыНаСкладахДатаПрихода;
			Движение.Организация = ОрганизацияТоваров;
			Движение.Склад = СкладПолучатель;
			Движение.Номенклатура = СтрокаТовара.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = СтрокаТовара.ХарактеристикаНоменклатуры;
			Движение.СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
			Движение.Количество = СтрокаТовара.Количество * СтрокаТовара.Коэффициент;
			// #16858 исправлено на суммы списания
			//Двиижение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СтрокаТовара.Сумма);
			//Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, СтрокаТовара.Сумма); //#8288
			Движение.Сумма = СтрокаТовара.Сумма;
			Движение.СуммаВал = СтрокаТовара.СуммаВал;
		КонецЦикла;
	КонецЕсли;
	
	//ТоварыВПутиНаСкладах (расход)
	Если СозданПриИспользованииСтатусовПеремещений И ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен Тогда
		Движения.ТоварыВПутиНаСкладах.Записывать = Истина;
		Для Каждого Товар Из мТовары Цикл
			Движение = Движения.ТоварыВПутиНаСкладах.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаПолучено;
			Движение.СкладОтправитель = СкладОтправитель;
			Движение.СкладПолучатель = СкладПолучатель;
			Движение.Номенклатура = Товар.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Движение.Количество = Товар.Количество * Товар.Коэффициент;
		КонецЦикла;	
	КонецЕсли;
	
	//ТоварыПроизводстваВПути
	Движения.ТоварыПроизводстваВПути.Записывать = Истина;
	Для Каждого ТекСтрока Из Товары Цикл
		Если ТекСтрока.Заказ.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		НоваяЗапись = Движения.ТоварыПроизводстваВПути.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.Заказ = ТекСтрока.Заказ;					
		НоваяЗапись.СкладОтправитель = СкладОтправитель;
		НоваяЗапись.СкладПолучатель = СкладПолучатель;	
		НоваяЗапись.Номенклатура = ТекСтрока.Номенклатура;
		НоваяЗапись.КоличествоОтправлено = ТекСтрока.Количество * ТекСтрока.Коэффициент;	
	КонецЦикла;
	Если (НЕ СозданПриИспользованииСтатусовПеремещений И Получено) 
		ИЛИ (СозданПриИспользованииСтатусовПеремещений И ТекущийСтатус = Перечисления.СтатусыПеремещений.Получен) Тогда
		Для Каждого ТекСтрока Из Товары Цикл
			Если ТекСтрока.Заказ.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			НоваяЗапись = Движения.ТоварыПроизводстваВПути.Добавить();
			НоваяЗапись.Период = ?(НЕ СозданПриИспользованииСтатусовПеремещений, ПолученоДата, ДатаПолучено);
			НоваяЗапись.Активность = Истина;
			НоваяЗапись.Заказ = ТекСтрока.Заказ;							
			НоваяЗапись.СкладОтправитель = СкладОтправитель;
			НоваяЗапись.СкладПолучатель = СкладПолучатель;
			НоваяЗапись.Номенклатура = ТекСтрока.Номенклатура;
			НоваяЗапись.КоличествоПолучено = ТекСтрока.Количество * ТекСтрока.Коэффициент;
		КонецЦикла;
	КонецЕсли;
	
	//ПотребностьВМатериалахДляМонтажа
	Движения.ПотребностьВМатериалахДляМонтажа.Записывать = Истина;
	Если ТипЗнч(Назначение) = Тип("ДокументСсылка.Монтаж") И НЕ Назначение.Пустая() Тогда
		Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Выдача Тогда
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Расход = Движения.ПотребностьВМатериалахДляМонтажа.Добавить();
				Расход.Период 							= Дата;
				Расход.ВидДвижения 						= ВидДвиженияНакопления.Расход;
				Расход.Монтаж 							= Назначение;
				Расход.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
				Расход.Количество 						= ТекСтрокаТовары.Количество * ТекСтрокаТовары.Коэффициент;
			КонецЦикла;
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Возврат Тогда
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Расход = Движения.ПотребностьВМатериалахДляМонтажа.Добавить();
				Расход.Период 							= Дата;
				Расход.ВидДвижения 						= ВидДвиженияНакопления.Расход;
				Расход.Монтаж 							= Назначение;
				Расход.Номенклатура 					= ТекСтрокаТовары.Номенклатура;
				Расход.Количество 						= -1 * (ТекСтрокаТовары.Количество * ТекСтрокаТовары.Коэффициент);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	// регистр ТоварыВРезервеНаСкладах Расход (15815)
	Движения.ТоварыВРезервеНаСкладах.Записывать = Истина;
	Если ВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров.Выдача Тогда
		// Получим выборку по резерву
		Выборка = РегистрыНакопления.ТоварыВРезервеНаСкладах.КонтрольРезерва(Основание, Организация, СкладОтправитель, Дата, Товары);
		Пока Выборка.Следующий() Цикл
			Если Выборка.КоличествоРезерве > 0 Тогда
				Движение = Движения.ТоварыВРезервеНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ВидТабличнойЧасти = Перечисления.ВидыТабличнойЧасти.Товары;
				Движение.ДокументРезерва = Основание;
				Движение.Организация = Организация;
				Движение.Склад = СкладОтправитель;
				Движение.Номенклатура = Выборка.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
				Движение.СерияНоменклатуры = Выборка.СерияНоменклатуры;
				Движение.Количество = ?(Выборка.Количество*Выборка.Коэффициент > Выборка.КоличествоРезерве, Выборка.КоличествоРезерве, Выборка.Количество*Выборка.Коэффициент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
		
	СозданПриИспользованииСтатусовПеремещений = Константы.ИспользоватьСтатусыПеремещений.Получить();
	Если СозданПриИспользованииСтатусовПеремещений Тогда
		ТекущийСтатус = Перечисления.СтатусыПеремещений.НачальныйСтатус();	
	КонецЕсли;
	 
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСтоимостьПриходаПоСписанию(ТаблицаТоваров)
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Для Каждого ТекущийТовар Из ТаблицаТоваров Цикл
		Цена = Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, ОрганизацияТоваров, СкладОтправитель, ТекущийТовар.Номенклатура, ТекущийТовар.ХарактеристикаНоменклатуры, ТекущийТовар.СерияНоменклатуры);
		ТекущийТовар.Сумма = ТекущийТовар.Количество * ТекущийТовар.Коэффициент * Цена;
	КонецЦикла;
	
КонецПроцедуры

//nva+++
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПредыдущийСтатус")
		И НЕ ТекущийСтатус = ДополнительныеСвойства.ПредыдущийСтатус 
		И ДополнительныеСвойства.ПредыдущийСтатус = Перечисления.СтатусыПеремещений.Получен
		И ТекущийСтатус = Перечисления.СтатусыПеремещений.Отменен Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя менять со статуса ""Получен"" на статус ""Отменен""", , , , Отказ);
	КонецЕсли; 
	
КонецПроцедуры
//nva---

#КонецОбласти

#КонецЕсли
